In [1]:
import pandas as pd
import numpy as np

## Duplicates

duplicated() and drop_duplicates()

Another important argument for drop_duplicates() is keep, which has three possible options:   

first: (default) Drop duplicates except for the first occurrence.   
last: Drop duplicates except for the last occurrence.   
False: Drop all duplicates.   
      
The two main methods that we will use are duplicated() and drop_duplicates().  The former returns a boolean series and the latter can be used to directly delete duplicate rows from a dataframe. For duplicated() method the inputs are:   
  
- keep   
    - "first": Mark duplicates as True except for the first occurrence.   
    - "last": Mark duplicates as True except for the last occurrence.   
    - False: Mark all duplicates as True   
      
For the drop_duplicates() method the keep arguments does the following.   
  
- keep  
    - "first": Drop duplicates except for the first occurrence.  
    - "last": Drop duplicates except for the last occurrence.  
    - False: Drop all duplicates   
      
The second arguments for both is:   

- subset: Only consider certain columns for identifying duplicates. If subset is not specific,  by default all of the columns will be used.

In [6]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,4,1],
        'Gender': ["Male", "Female", "Male","Female","Male"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [12]:
df.duplicated() # to check whether duplicated are there

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [14]:
df.duplicated().sum() # how many duplicate rows

1

In [18]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [24]:
# with keep = "first" - mark duplicates as True which you already encountered

duplicates_first=df.duplicated(keep = "last") #bottom  to top approach
duplicates_first

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [26]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [38]:
df1= df[~df.duplicated()] # display the not duplicated rows or cleaned data
df1

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No

In [34]:
df[df.duplicated()] # display the duplicated rows

   id Gender Married Loan_Status
4   1   Male     Yes         Yes

In [32]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [28]:
# with keep = "first" - mark duplicates as True which you already encountered

duplicates_first=df.duplicated(keep = "first") #top to bottom approach
duplicates_first

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [11]:
cleaned_df = df[~ duplicates_first]
cleaned_df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No

In [17]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [40]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,2,1],
        'Gender': ["Male", "Female", "Male","Female","Male"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [54]:
df.duplicated(keep="last")
# 2 duplicate rows are there

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [56]:
df.duplicated(keep="last").sum() # total duplicate rows

2

In [13]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [100]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,2,1],
        'Gender': ["Male", "Female", "Male","Female","Female"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1  Female     Yes         Yes

In [102]:
df.drop_duplicates(subset=['id','Gender'],inplace=True)
df.reset_index(inplace=True,drop=True)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   1  Female     Yes         Yes

In [84]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,2,1],
        'Gender': ["Male", "Female", "Male","Female","Female"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1  Female     Yes         Yes

In [86]:
df.duplicated(subset=['id','Gender'])

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [88]:
df= df[~df.duplicated(subset=['id','Gender'])]
df.reset_index(inplace=True,drop=True)

In [90]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   1  Female     Yes         Yes

In [64]:
df.duplicated(subset=['id'])

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [14]:
# with keep = "first" - mark duplicates as True which you already encountered

duplicates_last=df.duplicated(keep = "last") #bottom to top
duplicates_last

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [16]:
ans =df[~df.duplicated(keep = "last")]
ans

   id  Gender Married Loan_Status
1   2  Female      No          No
2   3    Male      No          No
3   4  Female      No          No
4   1    Male     Yes         Yes

In [16]:
ans.reset_index(drop=True)

   id  Gender Married Loan_Status
0   3    Male      No          No
1   2  Female      No          No
2   1    Male     Yes         Yes

In [25]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [31]:
df =df[~df.duplicated(keep='last')]

In [32]:
df

   id  Gender Married Loan_Status
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [36]:
df.reset_index(drop=True,inplace=True)

In [37]:
df

   id  Gender Married Loan_Status
0   3    Male      No          No
1   2  Female      No          No
2   1    Male     Yes         Yes

In [27]:
#how many duplicate rows?
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [27]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [42]:
df =df.reset_index()

df

   level_0  index  id  Gender Married Loan_Status
0        0      0   3    Male      No          No
1        1      1   2  Female      No          No
2        2      2   1    Male     Yes         Yes

In [43]:
df =df.drop('index',axis=1)

In [44]:
df =df.drop('level_0',axis=1)

In [46]:
df

   id  Gender Married Loan_Status
0   3    Male      No          No
1   2  Female      No          No
2   1    Male     Yes         Yes

In [34]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [48]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,2,1],
        'Gender': ["Male", "Female", "Male","Female","Male"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [54]:
df.duplicated(keep = "first") #dropping all duplicates

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [57]:
df.drop_duplicates(keep = "first",inplace=True) #dropping all duplicates

In [58]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No

In [60]:
# Creating dataframe using dictionary
import pandas as pd
dict1 = { 'id':[1,2,3,2,1],
        'Gender': ["Male", "Female", "Male","Female","Male"], 
        'Married':["Yes", "No","No","No","Yes"],
       'Loan_Status':["Yes", "No", "No","No" ,"Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [61]:
df2 = df.drop_duplicates(keep = False) #dropping all duplicates
df2

   id Gender Married Loan_Status
2   3   Male      No          No

In [36]:
df

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No
3   2  Female      No          No
4   1    Male     Yes         Yes

In [39]:
#Using drop_duplicates() method

df.drop_duplicates(keep = "first", subset="id")

   id  Gender Married Loan_Status
0   1    Male     Yes         Yes
1   2  Female      No          No
2   3    Male      No          No

In [104]:
# Creating dataframe using dictionary
dict1 = { 'id':[1,2,3,2,1],
         'adhar_card_no':[123,456,789,459,123],
        'Gender': ["Male", "Female", "Male", "Female","Male"], 
        'Married':["Yes", "No","No", "No","Yes"],
       'Loan_Status':["Yes", "No", "No", "No","Yes"]} 
  
df = pd.DataFrame(dict1)
df

   id  adhar_card_no  Gender Married Loan_Status
0   1            123    Male     Yes         Yes
1   2            456  Female      No          No
2   3            789    Male      No          No
3   2            459  Female      No          No
4   1            123    Male     Yes         Yes

In [68]:
df.drop_duplicates(keep = "first")

   id  adhar_card_no  Gender Married Loan_Status
0   1            123    Male     Yes         Yes
1   2            456  Female      No          No
2   3            789    Male      No          No
3   2            459  Female      No          No

In [65]:
df.duplicated(keep ="first", subset=["id","adhar_card_no"])

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [64]:
df.drop_duplicates(keep = "first", subset=["id","adhar_card_no"])

   id  adhar_card_no  Gender Married Loan_Status
0   1            123    Male     Yes         Yes
1   2            456  Female      No          No
2   3            789    Male      No          No
3   2            459  Female      No          No